# Вариант 8
# Дано целое число N (>0) и символ C. Вывести строку длины N, которая состоит из
# символов C.

N = int(input('Введите целое число, обязательно больше 0 :  '))
C = input('Введите символ:  ')
i = 0
i = N * C
print('Полученная строка:  ', i)
